In [258]:
from numpy import sum,array

In [259]:
sum(array([1,2,3]))

6

### pandas

In [260]:
import pandas as pd

In [261]:
pd.__version__

'1.1.3'

In [262]:
print(dir(pd))

['BooleanDtype', 'Categorical', 'CategoricalDtype', 'CategoricalIndex', 'DataFrame', 'DateOffset', 'DatetimeIndex', 'DatetimeTZDtype', 'ExcelFile', 'ExcelWriter', 'Float64Index', 'Grouper', 'HDFStore', 'Index', 'IndexSlice', 'Int16Dtype', 'Int32Dtype', 'Int64Dtype', 'Int64Index', 'Int8Dtype', 'Interval', 'IntervalDtype', 'IntervalIndex', 'MultiIndex', 'NA', 'NaT', 'NamedAgg', 'Period', 'PeriodDtype', 'PeriodIndex', 'RangeIndex', 'Series', 'SparseDtype', 'StringDtype', 'Timedelta', 'TimedeltaIndex', 'Timestamp', 'UInt16Dtype', 'UInt32Dtype', 'UInt64Dtype', 'UInt64Index', 'UInt8Dtype', '__builtins__', '__cached__', '__doc__', '__docformat__', '__file__', '__getattr__', '__git_version__', '__loader__', '__name__', '__package__', '__path__', '__spec__', '__version__', '_config', '_hashtable', '_is_numpy_dev', '_lib', '_libs', '_np_version_under1p16', '_np_version_under1p17', '_np_version_under1p18', '_testing', '_tslib', '_typing', '_version', 'api', 'array', 'arrays', 'bdate_range', 'compat', 'concat', 'core', 'crosstab', 'cut', 'date_range', 'describe_option', 'errors', 'eval', 'factorize', 'get_dummies', 'get_option', 'infer_freq', 'interval_range', 'io', 'isna', 'isnull', 'json_normalize', 'lreshape', 'melt', 'merge', 'merge_asof', 'merge_ordered', 'notna', 'notnull', 'offsets', 'option_context', 'options', 'pandas', 'period_range', 'pivot', 'pivot_table', 'plotting', 'qcut', 'read_clipboard', 'read_csv', 'read_excel', 'read_feather', 'read_fwf', 'read_gbq', 'read_hdf', 'read_html', 'read_json', 'read_orc', 'read_parquet', 'read_pickle', 'read_sas', 'read_spss', 'read_sql', 'read_sql_query', 'read_sql_table', 'read_stata', 'read_table', 'reset_option', 'set_eng_float_format', 'set_option', 'show_versions', 'test', 'testing', 'timedelta_range', 'to_datetime', 'to_numeric', 'to_pickle', 'to_timedelta', 'tseries', 'unique', 'util', 'value_counts', 'wide_to_long']

In [263]:
print(len(dir(pd)))

140

## pandas series

In [264]:
import pandas as pd
import numpy as np

In [265]:
mydata=np.arange(5,55)
print(mydata)

[ 5  6  7  8  9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28
 29 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47 48 49 50 51 52
 53 54]

In [266]:
arange?

Object `arange` not found.

In [267]:
np.arange?

In [268]:
mydata=np.arange(5,55,5)
print(mydata)

[ 5 10 15 20 25 30 35 40 45 50]

In [269]:
r=pd.Series(np.array([1,2,3,4,5]))

In [270]:
r

0    1
1    2
2    3
3    4
4    5
dtype: int32

In [271]:
r=pd.Series(np.array(["value",1,2,3,4,5]),index=["index",1,2,3,4,5])

In [272]:
r

index    value
1            1
2            2
3            3
4            4
5            5
dtype: object

In [273]:
help(np)

IOPub data rate exceeded.
The notebook server will temporarily stop sending output
to the client in order to avoid crashing it.
To change this limit, set the config variable
`--NotebookApp.iopub_data_rate_limit`.

Current values:
NotebookApp.iopub_data_rate_limit=1000000.0 (bytes/sec)
NotebookApp.rate_limit_window=3.0 (secs)

In [274]:
r.name="rollno"

In [275]:
r

index    value
1            1
2            2
3            3
4            4
5            5
Name: rollno, dtype: object

In [276]:
d={"a":10,"b":20}

In [277]:
d

{'a': 10, 'b': 20}

In [278]:
d.keys()

dict_keys(['a', 'b'])

In [279]:
d.values()

dict_values([10, 20])

In [280]:
d.items()

dict_items([('a', 10), ('b', 20)])

In [281]:
l=pd.Series(d,dtype='str')

In [282]:
l

a    10
b    20
dtype: object

In [283]:
l.name="marks"

In [284]:
l

a    10
b    20
Name: marks, dtype: object

In [285]:
l['a']

'10'

In [286]:
l[['a','b']]

a    10
b    20
Name: marks, dtype: object

In [287]:
l['a'::]

a    10
b    20
Name: marks, dtype: object

In [288]:
l.iloc[0]

'10'

In [289]:
l.loc['a']

'10'

In [290]:
l.loc['a'::]

a    10
b    20
Name: marks, dtype: object

### random values printing with out random

In [291]:
import random

In [292]:
a=random.randint(1,10)
b=random.randint(1,10)
if(a==b):
    print("win")
else:
    print("Better luck next time")

Better luck next time

In [293]:
c=pd.Series (np.array([9,8,7,6,5,4,3,2,1]),index=list('abcdefghi'),name="grades")

In [294]:
c

a    9
b    8
c    7
d    6
e    5
f    4
g    3
h    2
i    1
Name: grades, dtype: int32

In [295]:
c.keys()

Index(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i'], dtype='object')

In [296]:
for i in c.keys():
    if(c[i]>6):
        print(c[i])

9
8
7

In [297]:
c[c>6]

a    9
b    8
c    7
Name: grades, dtype: int32

In [298]:
c.mean()

5.0

In [299]:
c['a':'b'].mean()

8.5

In [300]:
c.std()

2.7386127875258306

In [301]:
c.var()

7.5

In [302]:
c['b']=20

In [303]:
c

a     9
b    20
c     7
d     6
e     5
f     4
g     3
h     2
i     1
Name: grades, dtype: int32

## data frames

### 2d

#### most intresting and important topic in padas is data frames

In [304]:
ms_marks={'sub1':[49,45,75,85,34],'sub2':[78,63,12,45,23],'sub3':[44,45,48,75,35],'sub4':[87,73,78,83,86]}

In [305]:
ms_marks

{'sub1': [49, 45, 75, 85, 34],
 'sub2': [78, 63, 12, 45, 23],
 'sub3': [44, 45, 48, 75, 35],
 'sub4': [87, 73, 78, 83, 86]}

In [359]:
m=pd.DataFrame(ms_marks,index=['keerthi😊','geetha😜','lohitha🤢','bharathi','harshitha'])
m

           sub1  sub2  sub3  sub4
keerthi😊     49    78    44    87
geetha😜      45    63    45    73
lohitha🤢     75    12    48    78
bharathi     85    45    75    83
harshitha    34    23    35    86

In [307]:
m.loc['lohitha🤢']

sub1    75
sub2    12
sub3    48
sub4    78
Name: lohitha🤢, dtype: int64

In [308]:
m.loc[['lohitha🤢','bharathi']]

          sub1  sub2  sub3  sub4
lohitha🤢    75    12    48    78
bharathi    85    45    75    83

In [309]:
m.loc[['lohitha🤢','bharathi']].sum()

sub1    160
sub2     57
sub3    123
sub4    161
dtype: int64

In [310]:
m.loc['lohitha🤢'].sum()

213

In [311]:
m.index

Index(['keerthi😊', 'geetha😜', 'lohitha🤢', 'bharathi', 'harshitha'], dtype='object')

In [312]:
m.columns

Index(['sub1', 'sub2', 'sub3', 'sub4'], dtype='object')

In [313]:
m.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, keerthi😊 to harshitha
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   sub1    5 non-null      int64
 1   sub2    5 non-null      int64
 2   sub3    5 non-null      int64
 3   sub4    5 non-null      int64
dtypes: int64(4)
memory usage: 360.0+ bytes

In [314]:
m.size

20

In [315]:
m.shape

(5, 4)

In [316]:
m.describe()

            sub1       sub2     sub3      sub4
count   5.000000   5.000000   5.0000   5.00000
mean   57.600000  44.200000  49.4000  81.40000
std    21.466253  27.307508  15.1096   5.85662
min    34.000000  12.000000  35.0000  73.00000
25%    45.000000  23.000000  44.0000  78.00000
50%    49.000000  45.000000  45.0000  83.00000
75%    75.000000  63.000000  48.0000  86.00000
max    85.000000  78.000000  75.0000  87.00000

In [317]:
m.sub1

keerthi😊     49
geetha😜      45
lohitha🤢     75
bharathi     85
harshitha    34
Name: sub1, dtype: int64

In [318]:
m['sub1']

keerthi😊     49
geetha😜      45
lohitha🤢     75
bharathi     85
harshitha    34
Name: sub1, dtype: int64

In [319]:
m[['sub1','sub4']]

           sub1  sub4
keerthi😊     49    87
geetha😜      45    73
lohitha🤢     75    78
bharathi     85    83
harshitha    34    86

In [320]:
m[['sub1','sub2','sub3']]

           sub1  sub2  sub3
keerthi😊     49    78    44
geetha😜      45    63    45
lohitha🤢     75    12    48
bharathi     85    45    75
harshitha    34    23    35

In [321]:
m[m>70]

           sub1  sub2  sub3  sub4
keerthi😊    NaN  78.0   NaN    87
geetha😜     NaN   NaN   NaN    73
lohitha🤢   75.0   NaN   NaN    78
bharathi   85.0   NaN  75.0    83
harshitha   NaN   NaN   NaN    86

In [322]:
m[m>70].index

Index(['keerthi😊', 'geetha😜', 'lohitha🤢', 'bharathi', 'harshitha'], dtype='object')

In [323]:
m.sub1['keerthi😊']

49

In [324]:
m.iloc[0][0:]

sub1    49
sub2    78
sub3    44
sub4    87
Name: keerthi😊, dtype: int64

In [325]:
m.iloc[0][1]

78

In [327]:
m['sub5']=[90,99,98,89,65]

In [328]:
m

           sub1  sub2  sub3  sub4  sub5
keerthi😊     49    78    44    87    90
geetha😜      45    63    45    73    99
lohitha🤢     75    12    48    78    98
bharathi     85    45    75    83    89
harshitha    34    23    35    86    65

### drop col

In [334]:
m.drop(columns='sub2')

           sub1  sub3  sub4  sub5
keerthi😊     49    44    87    90
geetha😜      45    45    73    99
lohitha🤢     75    48    78    98
bharathi     85    75    83    89
harshitha    34    35    86    65

In [335]:
m

           sub1  sub2  sub3  sub4  sub5
keerthi😊     49    78    44    87    90
geetha😜      45    63    45    73    99
lohitha🤢     75    12    48    78    98
bharathi     85    45    75    83    89
harshitha    34    23    35    86    65

In [360]:
m.drop(columns='sub2',axis=1,inplace=True)

In [357]:
m

           sub1  sub3  sub4  sub5
keerthi😊     49    44    87    90
geetha😜      45    45    73    99
lohitha🤢     75    48    78    98
bharathi     85    75    83    89
harshitha    34    35    86    65

In [364]:
m.drop("harshitha",inplace=True)

In [365]:
m

          sub1  sub3  sub4
keerthi😊    49    44    87
geetha😜     45    45    73
lohitha🤢    75    48    78
bharathi    85    75    83

In [369]:
m.iloc[1][1]

45

In [370]:
m.iloc[1][1]=68

In [371]:
m

          sub1  sub3  sub4
keerthi😊    49    44    87
geetha😜     45    68    73
lohitha🤢    75    48    78
bharathi    85    75    83

In [374]:
m.sub3=100

In [375]:
m

          sub1  sub3  sub4
keerthi😊    49   100    87
geetha😜     45   100    73
lohitha🤢    75   100    78
bharathi    85   100    83

In [387]:
m['sub4']=90

In [388]:
m

          sub1  sub3  sub4
keerthi😊    49   100    90
geetha😜     45   100    90
lohitha🤢    75   100    90
bharathi    85   100    90

## csv

In [417]:
import pandas as pd

In [418]:
data=pd.read_csv('p.csv')

In [419]:
data

,2000,2001,2002,2003,2004,2005,2006,2007,2008,2009,2010
0,9.1,9.2,9.3,9.4,9.5,9.6,9.7,9.8.9.9,10,10.3,10.5
1,120.0,121.0,122.0,123.0,124.0,125.0,126.0,127,128,129.0,130.0
2,14.0,15.0,16.0,17.0,18.0,19.0,20.0,21,22,23.0,24.0
3,9.1,9.2,9.3,9.4,9.5,9.6,9.7,9.8.9.9,10,10.3,10.5
4,120.0,121.0,122.0,123.0,124.0,125.0,126.0,127,128,129.0,130.0
5,14.0,15.0,16.0,17.0,18.0,19.0,20.0,21,22,23.0,24.0
6,9.1,9.2,9.3,9.4,9.5,9.6,9.7,9.8.9.9,10,10.3,10.5
7,120.0,121.0,122.0,123.0,124.0,125.0,126.0,127,128,129.0,130.0
8,14.0,15.0,16.0,17.0,18.0,19.0,20.0,21,22,23.0,24.0

In [420]:
data.shape

(9, 11)

In [421]:
data.size

99

In [422]:
data.columns

Index(['2000', '2001', '2002', '2003', '2004', '2005', '2006', '2007', '2008',
       '2009', '2010'],
      dtype='object')

In [423]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 11 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   2000    9 non-null      float64
 1   2001    9 non-null      float64
 2   2002    9 non-null      float64
 3   2003    9 non-null      float64
 4   2004    9 non-null      float64
 5   2005    9 non-null      float64
 6   2006    9 non-null      float64
 7   2007    9 non-null      object
 8   2008    9 non-null      int64
 9   2009    9 non-null      float64
 10  2010    9 non-null      float64
dtypes: float64(9), int64(1), object(1)
memory usage: 920.0+ bytes

In [429]:
data.index=["India","China","england","Australia","North korea","south korea","pakisthan","nepal","srilanka"]

In [432]:
data

,2000,2001,2002,2003,2004,2005,2006,2007,2008,2009,2010
India,9.1,9.2,9.3,9.4,9.5,9.6,9.7,9.8.9.9,10,10.3,10.5
China,120.0,121.0,122.0,123.0,124.0,125.0,126.0,127,128,129.0,130.0
england,14.0,15.0,16.0,17.0,18.0,19.0,20.0,21,22,23.0,24.0
Australia,9.1,9.2,9.3,9.4,9.5,9.6,9.7,9.8.9.9,10,10.3,10.5
North korea,120.0,121.0,122.0,123.0,124.0,125.0,126.0,127,128,129.0,130.0
south korea,14.0,15.0,16.0,17.0,18.0,19.0,20.0,21,22,23.0,24.0
pakisthan,9.1,9.2,9.3,9.4,9.5,9.6,9.7,9.8.9.9,10,10.3,10.5
nepal,120.0,121.0,122.0,123.0,124.0,125.0,126.0,127,128,129.0,130.0
srilanka,14.0,15.0,16.0,17.0,18.0,19.0,20.0,21,22,23.0,24.0

In [433]:
a=pd.read_excel('Book1.xlsx')

In [434]:
a

  Unnamed: 0  daa  cd  dp  sa  mad
0          a   23  56  23  56   64
1          b    9  32  23  34   34
2          c   65  67  44  24   41
3          d   53  57  54  21   24